<?php
//+------------------------------------------------------------------
//| 这是一个演示案例（如果将本包作为独立项目运行，也是可以这样运行的）
//| 更多的可能是被导入到其他框架中,如果是的话，那么可能需要结合框架的
//| 自定义命令行功能，其实本库的引用核心是：Worker::run($config);
//| 只需要在引用出，保证传递的$config符合要求即可
//+------------------------------------------------------------------
//| Author Liu LianSen <liansen@d3zz.com> 
//+------------------------------------------------------------------
//| Date 2018-07-16
//+------------------------------------------------------------------
use amqconsumer\lib\Worker;
$autoLoadFile = dirname(__DIR__) .'/vendor/autoload.php';

if(is_file($autoLoadFile)){ //作为独立项目代码
    require $autoLoadFile;
}else{ //被作为库，通过composer安装进其他项目
    require '../../../autoload.php';
}
Worker::run(include './config.php');
